#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.available: Reading...
module.wireguard.data.aws_ec2_instance_type.this: Reading...
module.nat.data.aws_ec2_instance_type.selected: Reading...
data.aws_ssm_parameter.wireguard_peer_public_key: Reading...
data.aws_ssm_parameter.wireguard_peer_source_ip: Reading...
module.nat.aws_iam_role.this: Refreshing state... [id=vpc-us-east-1-prd-nat-role]
data.aws_ssm_parameter.wireguard_interface_private_key: Reading...
module.wireguard.aws_iam_role.this: Refreshing state... [id=vpc-us-east-1-prd-wireguard-role]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02f71590ffce04a6d]
aws_eip.wireguard: Refreshing state... [id=eipalloc-00555fc512ee6c4a9]
data.aws_ssm_parameter.wireguard_interface_private_key: Read complete after 1s [id=/prd/aws-networking/wireguard-interface-private-key]
data.aws_ssm_parameter.wireguard_peer_public_key: Read complete after 1s [id=/prd/aws-networking/wireguard-peer-public-key]
data.aws_ssm_parameter.wireguard_peer_source_ip: Read complete after 1s [id=/prd/aws-networking/wireguard-peer-source-ip]
module.wireguard.data.aws_ec2_instance_type.this: Read complete after 1s [id=t4g.nano]
module.nat.data.aws_ec2_instance_type.selected: Read complete after 1s [id=t4g.nano]
module.wireguard.data.aws_ami.this: Reading...
module.nat.data.aws_ami.fck_nat: Reading...
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
module.wireguard.aws_iam_instance_profile.this: Refreshing state... [id=vpc-us-east-1-prd-wireguard-instance-profile]
module.wireguard.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonSSMManagedEC2InstanceDefaultPolicy"]: Refreshing state... [id=vpc-us-east-1-prd-wireguard-role-20250104224535713700000001]
module.nat.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonSSMManagedEC2InstanceDefaultPolicy"]: Refreshing state... [id=vpc-us-east-1-prd-nat-role-20241231192803224900000001]
module.nat.aws_iam_instance_profile.this: Refreshing state... [id=vpc-us-east-1-prd-nat-instance-profile]
module.nat.data.aws_ami.fck_nat: Read complete after 0s [id=ami-075a0093cd9926d44]
module.wireguard.data.aws_ami.this: Read complete after 0s [id=ami-08cf815cff6ee258a]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0c7d69b1ce54dc090]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d0823136d4d8684e]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0d938e60a6926f078]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-06708985e3206850f]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-08368933c60282243]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08ff933fc0cd1a8ed]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09570b4468b3fc794]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0ac57b68b9ecc3021]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0cf27de01155493d6]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-05b1659ce2fe16e2c]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0c9c6a3cb3c951e27]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06c4b56d1b75b8310]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-04da9a7dd058adaee]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04c387144d0f7b1c3]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-001198b7fde46da8f]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-022d83949d5645880]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0b1443d53ffdace20]
module.nat.data.aws_subnet.selected: Reading...
module.wireguard.data.aws_subnet.this: Reading...
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0d938e60a6926f0781080289494]
module.wireguard.data.aws_subnet.this: Read complete after 0s [id=subnet-09570b4468b3fc794]
module.wireguard.data.aws_vpc.this: Reading...
module.nat.data.aws_subnet.selected: Read complete after 0s [id=subnet-09570b4468b3fc794]
module.nat.data.aws_vpc.selected: Reading...
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-07756c215d0f1ed17]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0762fa9cc0db44716]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0350dc3c543036138]
module.nat.data.aws_vpc.selected: Read complete after 1s [id=vpc-02f71590ffce04a6d]
module.nat.aws_security_group.this: Refreshing state... [id=sg-07c4d256cab7a8737]
module.wireguard.data.aws_vpc.this: Read complete after 1s [id=vpc-02f71590ffce04a6d]
module.wireguard.aws_security_group.this: Refreshing state... [id=sg-0d8a7ab9ad4ef40cc]
module.nat.aws_vpc_security_group_egress_rule.all: Refreshing state... [id=sgr-050f1602f0e9d3559]
module.nat.aws_vpc_security_group_ingress_rule.cidr_block: Refreshing state... [id=sgr-014518305cd70639a]
module.nat.aws_network_interface.this: Refreshing state... [id=eni-07da500abdb01794c]
module.wireguard.aws_vpc_security_group_egress_rule.this: Refreshing state... [id=sgr-023bb205c39affd31]
module.wireguard.aws_network_interface.this: Refreshing state... [id=eni-0a64886a20ee422c6]
module.wireguard.aws_vpc_security_group_ingress_rule.this: Refreshing state... [id=sgr-0ab688eb3ec0526fe]
aws_route.nat["rtb-0c9c6a3cb3c951e27"]: Refreshing state... [id=r-rtb-0c9c6a3cb3c951e271080289494]
aws_route.nat["rtb-06c4b56d1b75b8310"]: Refreshing state... [id=r-rtb-06c4b56d1b75b83101080289494]
aws_route.nat["rtb-04da9a7dd058adaee"]: Refreshing state... [id=r-rtb-04da9a7dd058adaee1080289494]
module.nat.aws_launch_template.this: Refreshing state... [id=lt-0aaf44fb5be81d220]
module.wireguard.aws_eip_association.this: Refreshing state... [id=eipassoc-0da7ab8bbb667419c]
module.wireguard.aws_launch_template.this: Refreshing state... [id=lt-023410c07a53f0da1]
module.nat.aws_autoscaling_group.this: Refreshing state... [id=vpc-us-east-1-prd-nat-asg]
module.wireguard.aws_autoscaling_group.this: Refreshing state... [id=vpc-us-east-1-prd-wireguard-asg]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.wireguard.aws_security_group.this has changed
  ~ resource "aws_security_group" "this" {
        id                     = "sg-0d8a7ab9ad4ef40cc"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "66.31.28.105/32",
                ]
              - description      = "Allow UDP traffic from WireGuard peer allowed IP into vpc-us-east-1-prd-wireguard-sg"
              - from_port        = 51820
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "udp"
              - security_groups  = []
              - self             = false
              - to_port          = 51820
            },
          + {
              + cidr_blocks      = [
                  + "73.186.156.239/32",
                ]
              + description      = "Allow UDP traffic from WireGuard peer allowed IP into vpc-us-east-1-prd-wireguard-sg"
              + from_port        = 51820
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 51820
            },
        ]
        name                   = "vpc-us-east-1-prd-wireguard-sg"
        tags                   = {
            "Name"        = "vpc-us-east-1-prd-wireguard"
            "environment" = "prd"
            "project"     = "aws-networking"
            "terraform"   = "true"
        }
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_route.wireguard["rtb-04da9a7dd058adaee"] will be created
  + resource "aws_route" "wireguard" {
      + destination_cidr_block = "192.168.2.0/24"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = "eni-0a64886a20ee422c6"
      + origin                 = (known after apply)
      + route_table_id         = "rtb-04da9a7dd058adaee"
      + state                  = (known after apply)
    }

  # aws_route.wireguard["rtb-06c4b56d1b75b8310"] will be created
  + resource "aws_route" "wireguard" {
      + destination_cidr_block = "192.168.2.0/24"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = "eni-0a64886a20ee422c6"
      + origin                 = (known after apply)
      + route_table_id         = "rtb-06c4b56d1b75b8310"
      + state                  = (known after apply)
    }

  # aws_route.wireguard["rtb-0c9c6a3cb3c951e27"] will be created
  + resource "aws_route" "wireguard" {
      + destination_cidr_block = "192.168.2.0/24"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = "eni-0a64886a20ee422c6"
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0c9c6a3cb3c951e27"
      + state                  = (known after apply)
    }

  # module.wireguard.aws_launch_template.this will be updated in-place
  ~ resource "aws_launch_template" "this" {
        id                      = "lt-023410c07a53f0da1"
      ~ image_id                = "ami-02dcfe5d1d39baa4e" -> "ami-08cf815cff6ee258a"
      ~ latest_version          = 3 -> (known after apply)
        name                    = "vpc-us-east-1-prd-wireguard-lt"
        tags                    = {
            "Name"        = "vpc-us-east-1-prd-wireguard"
            "environment" = "prd"
            "project"     = "aws-networking"
            "terraform"   = "true"
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mmccarthy404, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-ci`*